#
# taps
#
tap "romkatv/powerlevel10k"

#
# brew
#
brew "mas"
brew "neovim"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gh"
brew "aria2"
brew "nnn"
brew "fzf"
# for nvim coc plugin
brew "node"
brew "xcodegen"

#
# casks
#
cask "telegram"
cask "iterm2"
cask "raycast"
cask "fig"
cask "xcodes"
cask "discord"
cask "easyeda"
cask "obsidian"
cask "rar"
cask "arduino-ide"
cask "sf-symbols"

#
# mas - Mac appstore cli
#
