# taps
tap "romkatv/powerlevel10k"

# brew
brew "mas"
brew "neovim"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gh"
brew "aria2"
brew "nnn"
brew "fzf"

# casks
cask "telegram"
cask "iterm2"
cask "raycast"
cask "fig"
cask "xcodes"
cask "swiftcord"
cask "steam"

# mas - Mac appstore cli
